Python-numpy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-03 Wed 17:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Numpy &amp; Pandas</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dctrl" />
<link rel="stylesheet" type="text/css" href="/css/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Numpy &amp; Pandas</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbb40fcb">1. What are Numpy &amp; Pandas？</a></li>
<li><a href="#org9cfc737">2. Numpy</a>
<ul>
<li><a href="#org9bea7a6">2.1. Numpy &#x2013; 归纳</a>
<ul>
<li><a href="#orgfde4475">2.1.1. Array典型属性</a></li>
<li><a href="#org32c7141">2.1.2. Array类型创建</a></li>
<li><a href="#org5f17503">2.1.3. Array基本运算</a></li>
<li><a href="#orgd81952e">2.1.4. Array索引</a></li>
<li><a href="#orgf494e0f">2.1.5. Array的迭代输出</a></li>
<li><a href="#org12c0188">2.1.6. Array的合并</a></li>
<li><a href="#org61d2870">2.1.7. Array的分割</a></li>
<li><a href="#org84ccea1">2.1.8. Array的复制</a></li>
</ul>
</li>
<li><a href="#orgb1687ee">2.2. 细枝末节</a></li>
</ul>
</li>
<li><a href="#org1defa0a">3. 学习资源</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbb40fcb" class="outline-2">
<h2 id="orgbb40fcb"><span class="section-number-2">1</span> What are Numpy &amp; Pandas？</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
NumPy：作为多维数组(ndarray)容器，可以对数组执行元素级计算以及直接对数组执行数学运算的函数。其也是用于读写硬盘上基于数组的数据集的工具。数据处理速度比Python自身的嵌套列表要快很多。
</p>

<p>
Pandas: 是基于NumPy的一种工具，提供了快速便捷地处理结构化数据的大量数据结构和函数。使用最多的pandas对象主要是Series(一组数据及相应的索引标签）和DataFrame (二维表结构)。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org9cfc737" class="outline-2">
<h2 id="org9cfc737"><span class="section-number-2">2</span> Numpy</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9bea7a6" class="outline-3">
<h3 id="org9bea7a6"><span class="section-number-3">2.1</span> Numpy &#x2013; 归纳</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgfde4475" class="outline-4">
<h4 id="orgfde4475"><span class="section-number-4">2.1.1</span> Array典型属性</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
np.array.ndim
</p>

<p>
np.array.shapre
</p>

<p>
np.array.size
</p>
<div class="org-src-container">
<pre class="src src-Python">array = np.array([[1,2,3],
		 [2,3,4]])
print(array)

print('number of dim:',array.ndim)

print('shapre: ',array.shape)

print('size: ',array.size)
</pre>
</div>
</div>
</div>
<div id="outline-container-org32c7141" class="outline-4">
<h4 id="org32c7141"><span class="section-number-4">2.1.2</span> Array类型创建</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
np.array(&#x2026;,dtype=np.type)
</p>

<p>
np.zeros(&#x2026;)
</p>

<p>
np.empty(&#x2026;)
</p>

<p>
np.arange(10,20,2)
</p>

<p>
np.arange(9).reshapre((3,3))
</p>

<p>
np.linspace(1,10,20)
</p>

<p>
np.linspace(1,10,20).reshapre((5,4))
</p>
</div>
</div>
<div id="outline-container-org5f17503" class="outline-4">
<h4 id="org5f17503"><span class="section-number-4">2.1.3</span> Array基本运算</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
即基本矩阵运算&#x2026;+、-、*、**、dot
</p>

<p>
sum、min、max、axis &#x2013; 0/1
</p>

<p>
np.agrmin(); np.argmax() 两个函数分别对应求矩阵最小元素和最大元素的索引
</p>

<p>
np.mean() == np.average() 求矩阵均值
</p>

<p>
np.cumsum() 生成的每一项矩阵元素的值都为原矩阵按序累加到该项
</p>

<p>
np.diff() 生成的为每一行中后一项与前一项之差。故3行4列的矩阵通过函数计算得到的矩阵为3行3列
</p>

<p>
np.sort() 该方法,仅针对每一行进行从小到大的排序操作。
</p>

<p>
np.transpose() 矩阵的转置方法 &#x2013; 1
</p>

<p>
np.array.T 矩阵的转置方法 &#x2013; 2
</p>

<p>
np.clip(Array,Array_min,Array_max) 该方法，将矩阵中元素小于(大于)Array_min(Array_max)的值替换为对应值
</p>
</div>
</div>

<div id="outline-container-orgd81952e" class="outline-4">
<h4 id="orgd81952e"><span class="section-number-4">2.1.4</span> Array索引</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
a = np.array(&#x2026;)
</p>

<p>
a[3] 当a为一维矩阵时，则当前索引不用解释;当a为n维，则该索引含义为第4行
</p>

<p>
a[1, 1:3] numpy同样支持Python中如同list一样的切片操作
</p>
</div>
</div>
<div id="outline-container-orgf494e0f" class="outline-4">
<h4 id="orgf494e0f"><span class="section-number-4">2.1.5</span> Array的迭代输出</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
for row in A 按行输出
</p>

<p>
for column in A.T 按列输出
</p>

<p>
a.flatten() 将矩阵展开的函数，将矩阵展位为1维
</p>

<p>
for item in a.flat flat为矩阵的一个迭代器
</p>
</div>
</div>
<div id="outline-container-org12c0188" class="outline-4">
<h4 id="org12c0188"><span class="section-number-4">2.1.6</span> Array的合并</h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
np.vstack(array,array) 该方法，将两个矩阵上下合并。
</p>

<p>
np.hstack(array,array) 该方法，将两个矩阵左右合并。
</p>

<p>
np.newaxis() 该方法的应用环境请看：<a href="https://stackoverflow.com/questions/29241056/how-does-numpy-newaxis-work-and-when-to-use-it">numpy:newaxis() use circumstances</a> &#x2013; 1.将数组变换为列或行向量 2.
</p>

<p>
np.concatenate() 该方法能更方便的让你合并多个矩阵
</p>
</div>
</div>
<div id="outline-container-org61d2870" class="outline-4">
<h4 id="org61d2870"><span class="section-number-4">2.1.7</span> Array的分割</h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
等量分割：np.split(array,n,axis=0/1)  n&#x2013;分割出n个子集。axis &#x2013; 指示分割方向，当axis=0时，分割方向为横向；当axis=1时，分割方向为竖向
</p>

<p>
不等量分割：np.array_split(array,n,axis=0/1) n&#x2013;分割出n个子集，axis &#x2013; 指示分割方向，当axis=0时，分割方向为横向；当axis=1时，分割方向为竖向
</p>

<p>
np.vsplit(array,n) == np.split(array,n,axis=0)
</p>

<p>
np.hsplit(array,n) == np.split(array,n,axis=1)
</p>
</div>
</div>
<div id="outline-container-org84ccea1" class="outline-4">
<h4 id="org84ccea1"><span class="section-number-4">2.1.8</span> Array的复制</h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
对于numpy的array对象，直接使用 = 进行对象复制的时候，进行的是
</p>

<p>
numpy的array复制，array.copy()&#x2026;
</p>
</div>
</div>
</div>
<div id="outline-container-orgb1687ee" class="outline-3">
<h3 id="orgb1687ee"><span class="section-number-3">2.2</span> 细枝末节</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
numpy.random.seed() is not thread-safe
random.random.seed() is thread-safe(or at least, I haven't found any evidence to the contrary
numpy.random lib 对比 random.random拥有更多的常用于科研的概率分布模型。
然而以上两者皆不能适用于严肃的加密环境中的随机数生成要求

</pre>
</div>
</div>
</div>
<div id="outline-container-org1defa0a" class="outline-2">
<h2 id="org1defa0a"><span class="section-number-2">3</span> 学习资源</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://morvanzhou.github.io/tutorials/data-manipulation/np-pd/1-1-why/">莫烦Python Tutorial</a>
</p>

<p>
<a href="https://stackoverflow.com/questions/7029993/differences-between-numpy-random-and-random-random-in-python">Python中numpy.random和random.random的区别</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: dctrl</p>
<p class="date">Created: 2018-10-03 Wed 17:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
